Autodesk.Revit.DB.DirectContext3D.VertexStreamPosition.AddVertices(System.Collections.Generic.IList{Autodesk.Revit.DB.DirectContext3D.VertexPosition})
Inserts multiple Autodesk.Revit.DB.DirectContext3D.VertexStreamPosition instances into the stream and associated buffer.
vertices:
The vertices to be inserted.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if the associated buffer is not mapped.
-or-
Thrown if the associated buffer has insufficient space.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.VertexStreamPosition.AddVertex(Autodesk.Revit.DB.DirectContext3D.VertexPosition)
Inserts a Autodesk.Revit.DB.DirectContext3D.VertexStreamPosition into the stream and associated buffer.
vertex:
The vertex to be inserted.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if the associated buffer is not mapped.
-or-
Thrown if the associated buffer has insufficient space.
Since:
2017